<a href="https://colab.research.google.com/github/rio1004666/Colab/blob/main/3_Pandas%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
"""
날짜: 2021/10/18
이름: 강병화
내용: 파이썬  Pandas 실습하기 

Pandas 라이브러리 
- 파이썬 데이터 분석에 사용되는 DataFrame 자료구조를 지원하는 패키지 
- DataFrame을 가공,처리를 지원하는 패키지 
"""
import pandas as pd
# DataFrame 생성 
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df1

In [ ]:
# 컬럼명을 갖는 DataFrame
df2 = pd.DataFrame({'uid':['a101','a102','a103','a104','a105'],
                    'name':['김유신','김춘추','장보고','강감찬','이순신'],
                    'age':[25,21,24,51,44]})
df2

In [ ]:
# DataFrame 출력
print(df1[0][0])
print(df1[0][1])
print(df1[1][2])
print(df2['uid'][0])
print(df2['name'][0])
print(df2['age'][0])

In [ ]:
# CSV 파일 DataFrame 불러오기
df_exam = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/file/exam.csv')
df_exam

In [ ]:
# 기본 요약 통계
df_exam.describe()

In [ ]:
# 상위 5개
df_exam.head()

   id  class  math  english  science
0   1      1    50       98       50
1   2      1    60       97       60
2   3      1    45       86       78
3   4      1    30       98       58
4   5      2    25       80       65

In [ ]:
# 하위 5개 
df_exam.tail()

    id  class  math  english  science
15  16      4    58       98       65
16  17      5    65       68       98
17  18      5    80       78       90
18  19      5    89       68       87
19  20      5    78       83       58

In [ ]:
# DataFrame 인덱싱
# loc - 컬럼명 기반 인덱싱
df_math = df_exam.loc[:,'math']
print(df_math)
df_r1 = df_exam.loc[1:3,:]
print(df_r1)
df_r2 = df_exam.loc[10:,['math','english']]
print(df_r2)
df_r3 = df_exam.loc[1:4,['math','english','science']]
print(df_r3)


# iloc - 인덱스 기반 인덱싱 
df_r4 = df_exam.iloc[1:5,2:4] # 인덱스번호로 인덱싱을 한다. 
print(df_r4)

In [ ]:
 # 수학점수 60점이상 출력 
 df_exam[df_exam.math >= 60]

In [ ]:
# 수학점수 내림차순 
df_exam.sort_values(by='math',ascending=False)

In [ ]:
# 영어점수 60~70 내림차순
df_exam[(df_exam.english >= 60) & (df_exam.english <70)].sort_values(by='english', ascending=False)

In [ ]:
# 파생변수 
df_exam['total'] = df_exam.math + df_exam.english + df_exam.science
df_exam['mean'] = (df_exam.math + df_exam.english + df_exam.science)/3
df_exam['grade'] = ['A' if m >= 90 else
                    'B' if m >= 80 else
                    'C' if m >= 70 else
                    'D' if m >= 60 else 'F'
                    for m in df_exam['mean']]
df_exam